### Book (Core)

###### Part 1

Design an ERD ![png](BookCoreImage.png)

###### Part 2

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [3]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "Kassie18*" # (whatever password you chose during mysql installation)
db_name = "Books_Final"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

##### Read in data as cvs and then move to sql

In [5]:
author = pd.read_csv ('Data Folder/Authors.csv')
author.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [6]:
# add to sql
author.to_sql('author', engine, if_exists = 'replace')

5

In [7]:
books = pd.read_csv ('Data Folder/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [8]:
# add to sql
books.to_sql('books', engine, if_exists = 'replace')

6

In [9]:
favorites = pd.read_csv ('Data Folder/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [10]:
# add to sql
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [11]:
users = pd.read_csv ('Data Folder/Users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
# add to sql
users.to_sql('users', engine, if_exists = 'replace')

3

In [13]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_books_final
0                author
1                 books
2             favorites
3                 users

In [14]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN
favorites on books.id = favorites.book_id
WHERE favorites.user_id =
    (SELECT users.id From users WHERE (users.last_name = "Doe" AND users.first_name = "John"))"""

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

Part 3: Exporting the database and committing to GitHub